init.org
#+TITLE: Barrensea Emacs
#+AUTHOR: DonjuanPlatinum in Barrensea
#+DATE: 2024/6/22
#+STARTUP: overview
* key
** flycheck
| C-c C-c l | flycheck-list-errors | 显示错误列表 |
** basic
| C-c r | set-mark-command    | 选中 |
| C-c m | rectangle-mark-mode | 矩形选中 |
*** xref
| M . | xref-find-definitions | 跳转到引用的源代码处 |
| M , | xref-go-back          | 跳回去             |
| M ? | xref-find-references  | 列出所有的引用      |

** org
| M-o | 'org-insert-structure-template | 快速插入代码块 |

** hydra
| C-t |   |   |
* init.el
:PROPERTIES:
:HEADER-ARGS: :tangle init.el
:END:
=init.el=
# ** Desktop
# #+begin_src emacs-lisp
#   (desktop-save-mode 1)
# #+end_src
** 垃圾处理
#+begin_src emacs-lisp
  (setq gc-cons-percentage 0.5
      gc-cons-threshold (* 128 1024 1024))
#+end_src
** 导入路径
#+begin_src emacs-lisp
  (add-to-list 'load-path "~/.emacs.d/lisp/")
  (add-to-list 'load-path "~/.emacs.d/site-lisp/")
#+end_src

** 镜像设置
#+begin_src emacs-lisp
  (setq package-archives '(("gnu-mirror"   . "https://mirrors.tuna.tsinghua.edu.cn/elpa/gnu/")
			   ("melpa-mirror"  . "https://mirrors.tuna.tsinghua.edu.cn/elpa/melpa/")
			   ("nongnu-mirror" . "https://mirrors.tuna.tsinghua.edu.cn/elpa/nongnu/" )
			   ("org-mirror" . "https://mirrors.tuna.tsinghua.edu.cn/elpa/org/")
			   ))
#+end_src

** benchmark
#+begin_src emacs-lisp
  (use-package benchmark-init
    :ensure t
    :config
  ;; To disable collection of benchmark data after init is done.
    (add-hook 'after-init-hook 'benchmark-init/deactivate))
#+end_src
** unset-key
#+begin_src emacs-lisp
  (global-unset-key (kbd "C-x C-b")) ;; bufferlist换成ibuffer
  (global-unset-key (kbd "C-t"))  ;; hydra
  (global-unset-key (kbd "M-x")) ;; smex
#+end_src
** 配置导入
*** 变量
#+begin_src emacs-lisp
  ;; custom file
  (setq custom-file "~/.emacs.d/custom.el")
  (load custom-file)
#+end_src
*** 常规
#+begin_src emacs-lisp
  ;; ibuffer配置
  (require 'init-ibuffer)

  ;; emacs自带默认模式设置
  (require 'default-set)

  ;; benchmark
  (require 'init-benchmark)

  ;; easysession
  (require 'init-easysession)
#+end_src
*** 输入法
#+begin_src emacs-lisp
  (require 'init-rime)
#+end_src
*** 模式
#+begin_src emacs-lisp

  ;; org-mode
  (require 'init-org)

  ;; markdown-mode
  (require 'init-markdown)

  ;; rust
  (require 'init-rust)


  ;; flycheck
  (require 'init-flycheck)

  ;; python
  (require 'init-python)

  ;; yaml
  (require 'init-yaml)

  ;; maxima
  (require 'init-maxima)

  ;; docker
  (require 'init-docker)

  ;; gnuplot
  (require 'init-gnuplot)

  ;; nov
  (require 'init-nov)

  ;; sphinx
  (require 'init-sphinx)

  ;; uniline
  (require 'init-uniline)
#+end_src
*** 功能
#+begin_src emacs-lisp
  ;; embark
  (require 'init-embark)
  ;; company
  (require 'init-company)
  ;; whichkey
  (require 'init-whichkey)
  ;; undo-tree
  (require 'init-undo-tree)
  ;; curx
  (require 'init-crux)
  ;; keycast
  (require 'init-keycast)
  ;; tramp
  (require 'init-tramp)
  ;; aira2
  (require 'init-aria2)
  ;; hydra
  (require 'init-hydra)
  ;;smex
  (require 'init-smex)
#+end_src
*** git
#+begin_src emacs-lisp
  (require 'init-git)
#+end_src
*** 外观
#+begin_src emacs-lisp
  ;; 主题设置
  (require 'init-theme)
  ;; 括号色彩
  (require 'init-rainbow)
  ;; 启动面板
  (require 'init-dashboard)
#+end_src

*** 窗口
#+begin_src emacs-lisp
  (require 'init-ace-window)
  ;; treemacs
  (require 'init-treemacs)
  ;; battery
  (require 'init-battery)
  ;; zoom
  (require 'init-zoom)
#+end_src
** 垃圾处理开启
#+begin_src emacs-lisp
  (add-hook 'after-init-hook #'garbage-collect t)
#+end_src
** provide
#+begin_src emacs-lisp
  (provide 'init)
#+end_src
* custom.el
:PROPERTIES:
:HEADER-ARGS: :tangle custom.el :mkdirp yes
:END:

用户变量保存处

# ** rustic
# #+begin_src emacs-lisp
#   ;; rust-analyzer位置
#  (setq rustic-analyzer-command '("~/.cargo/bin/rust-analyzer"))
#  ;; lsp-client
#  (setq rustic-lsp-client 'eglot)		;
# #+end_src

** nix
#+begin_src emacs-lisp
  (setq rime-emacs-module-header-root "~/.nix-profile/include")
  
  (setq rime-librime-root "~/.nix-profile/")
#+end_src
** rime
#+begin_src emacs-lisp
  ;; 用户数据目录
  ;;(setq rime-user-data-dir "~/.emacs.d/rime-data")
  ;; 共享目录
  ;;(setq rime-share-data-dir "~/.config/fctix/rime-data")
        
#+end_src
** custom-set-face
#+begin_src emacs-lisp
  (custom-set-faces
 ;; custom-set-faces was added by Custom.
 ;; If you edit it by hand, you could mess it up, so be careful.
 ;; Your init file should contain only one such instance.
 ;; If there is more than one, they won't work right.
 '(region ((t (:extend t :background "cornflowerblue" :foreground "#bebec4")))))
#+end_src
** zoom
#+begin_src emacs-lisp
(custom-set-variables
 '(zoom-mode t))  
#+end_src
* lisp
** 通用配置
*** default-set.el
:PROPERTIES:
:HEADER-ARGS: :tangle lisp/default-set.el :mkdirp yes
:END:

基本的配置

**** 代理
#+begin_src emacs-lisp
  
;; 使用代理
(setq my-proxy "127.0.0.1:7890")

  (defun show-proxy ()
    "Show http/https proxy."
    (interactive)
    (if url-proxy-services
	(message "Current proxy is \"%s\"" my-proxy)
      (message "No proxy")))
    (defun set-proxy ()
    "Set http/https proxy."
    (interactive)
    (setq url-proxy-services `(("http" . ,my-proxy)
			       ("https" . ,my-proxy)))
    (show-proxy))

  (defun unset-proxy ()
    "Unset http/https proxy."
    (interactive)
    (setq url-proxy-services nil)
    (show-proxy))

  (defun toggle-proxy ()
    "Toggle http/https proxy."
    (interactive)
    (if url-proxy-services
	(unset-proxy)
      (set-proxy)))

  (global-set-key (kbd "C-c p") 'toggle-proxy)

#+end_src

**** bind
#+begin_src emacs-lisp
  ;; set-mark-command bind
  (global-set-key (kbd "C-c r") 'set-mark-command)
  ;; 矩形操作
  (global-set-key (kbd "C-c m") 'rectangle-mark-mode)
#+end_src
**** 习惯更改
#+begin_src emacs-lisp
  ;; 自动替换选择区内容
  (delete-selection-mode 1)
#+end_src
**** 功能更改
#+begin_src emacs-lisp
  ;; 自动补全括号
  (electric-pair-mode 1)

  ;; 关闭提示音
  (setq ring-bell-function 'ignore)

  ;; 显示行号
  (global-display-line-numbers-mode 'open)
  (column-number-mode 1)

  ;; 关闭自动备份~文件
  (setq make-backup-files nil)
  (setq auto-save-default nil)


#+end_src
**** provide
#+begin_src emacs-lisp
  (provide 'default-set)
#+end_src
*** init-ibuffer.el
:PROPERTIES:
:HEADER-ARGS: :tangle lisp/init-ibuffer.el :mkdirp yes
:END:
**** bind
#+begin_src emacs-lisp
  
  (global-set-key (kbd "C-x C-b") 'ibuffer)
#+end_src
**** 配置
#+begin_src emacs-lisp
  ;; 不显示空组
  (setq ibuffer-show-empty-filter-groups nil)
#+end_src
**** ibuffer主体
#+begin_src emacs-lisp
  (setq ibuffer-saved-filter-groups
      '(("ibuffer"
	 ("rust"
	  (used-mode . rust-mode))
	 ("python"
	  (used-mode . python-mode))
	 ("org_note"
	  (used-mode . org-mode))
	 ("typst"
	  (used-mode . typst--markup-mode))
	 ("elisp"
	  (used-mode . emacs-lisp-mode))
	 ("haskell"
	  (used-mode . haskell-mode))
	 ("matrix"
	  (name . "Ement*"))
	 ("irc query"
	  (used-mode . circe-query-mode))
	 ("dired"
	  (used-mode . dired-mode))
	 ("conf"
	  (used-mode . conf-unix-mode))
	 ("toml"
	  (used-mode . conf-toml-mode))
	 ("markdown"
	  (used-mode . markdown-mode))
	 ("docker-compose"
	  (name . "docker-compose"))
	 ("message"
	  (used-mode . messages-buffer-mode))
	 ("magit"
	  (name . "magit*"))
	 ("special"
	  (used-mode . special-mode))
	 ("irc"
	  (used-mode . circe-channel-mode)))))
#+end_src
**** provide
#+begin_src emacs-lisp
  (provide 'init-ibuffer)
#+end_src

*** init-benchmark.el
:PROPERTIES:
:HEADER-ARGS: :tangle lisp/init-benchmark.el :mkdirp yes
:END:
**** benchmark
#+begin_src emacs-lisp

#+end_src

**** provide
#+begin_src emacs-lisp
  (provide 'init-benchmark)
#+end_src

*** init-easysession.el
:PROPERTIES:
:HEADER-ARGS: :tangle lisp/init-easysession.el :mkdirp yes
:END:

**** easysession
#+begin_src emacs-lisp
  (use-package easysession
  :ensure t
  :defer t
  :commands (easysession-switch-to
             easysession-save-as
             easysession-save-mode
             easysession-load-including-geometry)
  :bind
  ("C-c l" . easysession-switch-to)
  ("C-c s" . easysession-save-as)
  :custom
  (easysession-mode-line-misc-info t)  ; Display the session in the modeline
  (easysession-save-interval (* 10 60))  ; Save every 10 minutes

  :init
  (add-hook 'emacs-startup-hook #'easysession-load-including-geometry 102)
  (add-hook 'emacs-startup-hook #'easysession-save-mode 103))
#+end_src
**** provide
#+begin_src emacs-lisp
  (provide 'init-easysession)
#+end_src

** 模式配置
*** init-company.el
:PROPERTIES:
:HEADER-ARGS: :tangle lisp/init-company.el :mkdirp yes
:END:
~company~ 自动补全
**** company主体
#+begin_src emacs-lisp
  (use-package company
    :ensure t
    :defer t
;    :init (global-company-mode)
    :hook
    (prog-mode . company-mode) ; 编程模式启用company-mode
    :config
    (setq company-minimum-prefix-length 1) ;;一个字开始补全
    (setq company-show-quick-access t)
    (setq company-show-numbers t) ;;显示选项编号
    )
#+end_src

**** company-quickhelp
#+begin_src emacs-lisp
    ;; 提供上下文帮助
  (use-package company-quickhelp
    :ensure t
    :defer t
    :hook (company-mode . company-quickhelp-mode)
    :config
    (setq company-quickhelp-delay 0.5))  ;; 设置帮助显示延迟
#+end_src
**** company拓展
***** nginx
#+begin_src emacs-lisp
  (use-package company-nginx
    :ensure t
    :defer t
  )
#+end_src
**** provide
#+begin_src emacs-lisp
  (provide 'init-company)
#+end_src
*** init-markdown.el
:PROPERTIES:
:HEADER-ARGS: :tangle lisp/init-markdown.el :mkdirp yes
:END:
markdown

**** markdown主体
#+begin_src emacs-lisp
    ;; 安装 markdown-mode
  (use-package markdown-mode
    :ensure t
    :defer t
    :mode ("\\.md\\'" "\\.markdown\\'")
    :commands (markdown-mode gfm-mode)
    :config
    (setq markdown-command "pandoc") ;; 可选：使用 pandoc 作为Markdown 渲染工具
    ;; 配置 Markdown 快捷键
    (bind-key "C-c C-c" 'markdown-command markdown-mode-map)
  
    ;; 自定义 Markdown 编辑器行为
    (setq markdown-fontify-code-blocks-natively t) ;; 高亮代码块
    (setq markdown-enable-math t) ;; 启用数学公式支持
    (setq markdown-hide-markup t)) ;; 隐藏标记符
#+end_src

**** markdown-preview
#+begin_src emacs-lisp
  (use-package markdown-preview-mode
  :ensure t
  :defer t
  :commands markdown-preview
  :config
  (setq markdown-preview-stylesheets
	'("~/.emacs.d/css/github-markdown.css"))
  )

#+end_src
**** provide
#+begin_src emacs-lisp
  (provide 'init-markdown)
#+end_src
*** init-org.el
:PROPERTIES:
:HEADER-ARGS: :tangle lisp/init-org.el :mkdirp yes
:END:
*org-mode*

**** org主体
**** org-modern
**** org-appear
自动展开
#+begin_src emacs-lisp
  (use-package org-appear
  :ensure t
  :defer t
  :hook (org-mode . org-appear-mode)
  :config
  (setq org-appear-autolinks t)
  (setq org-appear-autosubmarkers t)
  (setq org-appear-autoentities t)
  (setq org-appear-autokeywords t)
  (setq org-appear-inside-latex t)
  )
#+end_src
**** org-contrib
#+begin_src emacs-lisp
  ;; Org mode的附加包，有诸多附加功能
  (use-package org-contrib
    :defer t
    :ensure t)
#+end_src

**** org-download
#+begin_src emacs-lisp
  ;; 粘贴图片到org mode
(use-package org-download
  :ensure t
  :defer t ;; 延迟加载
  :bind
  (:map org-mode-map
        ("C-M-y" . org-download-clipboard)) ;; 绑定从剪贴版粘贴截图的快捷键
  :custom
  (org-download-heading-lvl 1) ;; 用一级标题给截图文件命名
  :config
  (setq-default org-download-image-dir "./imgs")) ;; 用同级 ./img 目录放置截图文件
(add-hook 'dired-mode-hook 'org-download-enable)

#+end_src
**** org-fragtog
#+begin_src emacs-lisp
  ;; 显示latex公式
  (use-package org-fragtog
    :ensure t
    :defer t
    :hook
    (org-mode . org-fragtog-mode)
    )
#+end_src
**** toc-org
#+begin_src emacs-lisp
  (use-package toc-org
  :ensure t
  :defer t
  )

  (add-hook 'org-mode-hook 'toc-org-mode)
  (add-hook 'markdown-mode-hook 'toc-org-mode)
#+end_src

**** easy-hugo
#+begin_src emacs-lisp
  (use-package easy-hugo
    :ensure t
    :defer t
    )
  (setq easy-hugo-basedir "~/project/donjuan")
#+end_src
**** export
***** ox-gfm
导出markdown
#+begin_src emacs-lisp
  (use-package ox-gfm
  :ensure t
  :defer t
  :after ox)
#+end_src
**** insert
#+begin_src emacs-lisp
  (global-set-key (kbd "M-o") 'org-insert-structure-template)
#+end_src
**** src
#+begin_src emacs-lisp
  ;; 代码块高亮
  (setq org-src-fontify-natively t)
#+end_src

**** provide
#+begin_src emacs-lisp
  (provide 'init-org)
#+end_src
*** init-polymode.el
:PROPERTIES:
:HEADER-ARGS: :tangle lisp/init-polymode.el :mkdirp yes
:END:
poly
**** 主体
#+begin_src emacs-lisp
  (use-package polymode
    :defer t
    :ensure t)
#+end_src
**** provide
#+begin_src emacs-lisp
  (provide 'init-polymode)
#+end_src
*** init-rust.el
:PROPERTIES:
:HEADER-ARGS: :tangle lisp/init-rust.el :mkdirp yes
:END:
rust
# **** rustic
# #+begin_src emacs-lisp
#  (use-package rustic
#  :ensure t)
#  
# #+end_src
**** rust-mode
#+begin_src emacs-lisp
  (use-package rust-mode
    :defer t
    :ensure t)
#+end_src
**** provide
#+begin_src emacs-lisp
  (provide 'init-rust)
#+end_src

*** init-flycheck.el
:PROPERTIES:
:HEADER-ARGS: :tangle lisp/init-flycheck.el :mkdirp yes
:END:
**** flycheck
#+begin_src emacs-lisp
  (use-package flycheck
    :ensure t
    :defer t
    :config
    (setq truncate-lines nil) ;自动换行
;    :init (global-flycheck-mode)
    )
#+end_src
**** flycheck-rust
#+begin_src emacs-lisp
  (use-package flycheck-rust
  :ensure t
  :defer t
  )
#+end_src
**** provide
#+begin_src emacs-lisp
  (provide 'init-flycheck)
#+end_src

*** init-python.el
:PROPERTIES:
:HEADER-ARGS: :tangle lisp/init-python.el :mkdirp yes
:END:

**** python-mode
#+begin_src emacs-lisp
  (use-package python-mode
  :defer t
  :ensure t
  :defer t
  )
#+end_src

**** provide
#+begin_src emacs-lisp
  (provide 'init-python)
#+end_src

*** init-yaml.el
:PROPERTIES:
:HEADER-ARGS: :tangle lisp/init-yaml.el :mkdirp yes
:END:

**** yaml-mode
#+begin_src emacs-lisp
  (use-package yaml-mode
    :ensure t
    :defer t
    )
#+end_src

**** provide
#+begin_src emacs-lisp
  (provide 'init-yaml)
#+end_src

*** init-maxima.el
:PROPERTIES:
:HEADER-ARGS: :tangle lisp/init-maxima.el :mkdirp yes
:END:

**** maxima
#+begin_src emacs-lisp
  (use-package maxima
    :ensure t
    :defer t
    ) 
#+end_src

**** provide
#+begin_src emacs-lisp
  (provide 'init-maxima)
#+end_src

*** init-docker.el
:PROPERTIES:
:HEADER-ARGS: :tangle lisp/init-docker.el :mkdirp yes
:END:

**** dockerfile-mode
#+begin_src emacs-lisp
  (use-package dockerfile-mode
    :ensure t
    :defer t
    )
#+end_src
**** provide
#+begin_src emacs-lisp
  (provide 'init-docker)
#+end_src

*** init-gnuplot.el
:PROPERTIES:
:HEADER-ARGS: :tangle lisp/init-gnuplot.el :mkdirp yes
:END:
**** gnuplot
#+begin_src emacs-lisp
  (use-package gnuplot
    :ensure t
    :defer t
    )
#+end_src
**** provide
#+begin_src emacs-lisp
  (provide 'init-gnuplot)
#+end_src

*** init-nov.el
:PROPERTIES:
:HEADER-ARGS: :tangle lisp/init-nov.el :mkdirp yes
:END:
**** nov
#+begin_src emacs-lisp
  (use-package nov
    :ensure t
    :defer t
    )
#+end_src

**** provide
#+begin_src emacs-lisp
  (provide 'init-nov)
#+end_src

*** init-sphinx.el
:PROPERTIES:
:HEADER-ARGS: :tangle lisp/init-sphinx.el :mkdirp yes
:END:
文档生成器
**** sphinx-doc
#+begin_src emacs-lisp
  (use-package sphinx-mode
    :ensure t
    :defer t
    )
#+end_src
**** provide
#+begin_src emacs-lisp
  (provide 'init-sphinx)
#+end_src

*** init-uniline.el
:PROPERTIES:
:HEADER-ARGS: :tangle lisp/init-uniline.el :mkdirp yes
:END:
unicode绘图
